# Pandas基础 
## 1. 目标
1. Pandas的两种数据结构
2. Pandas的操作工具

## 2. Pandas 概况
让数据分析变得简单的一个模块.
特点:
1. 基于NumPy
2. 2008年
3. 数据对齐
4. 可灵活处理缺失数据
5. 集成了时间序列功能

## 3. Pandas 导入

In [1]:
# 约定
from pandas import Series, DataFrame
import pandas as pd

## 4. Pandas的数据结构
Pandas中有两种数据结构:Series, DataFrame.
### 4.1 Series的创建

In [2]:
from pandas import Series, DataFrame
import numpy as np
obj = Series([1,1,2,3,5])

In [3]:
obj

0    1
1    1
2    2
3    3
4    5
dtype: int64

In [4]:
obj.values

array([1, 1, 2, 3, 5], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj = Series([1,1,2,3,5], index=["a","b","c","d","f"])
obj

a    1
b    1
c    2
d    3
f    5
dtype: int64

In [7]:
obj.index

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [8]:
obj ** 2

a     1
b     1
c     4
d     9
f    25
dtype: int64

In [9]:
obj + 1

a    2
b    2
c    3
d    4
f    6
dtype: int64

In [10]:
np.sin(obj)

a    0.841471
b    0.841471
c    0.909297
d    0.141120
f   -0.958924
dtype: float64

In [11]:
np.exp(obj)

a      2.718282
b      2.718282
c      7.389056
d     20.085537
f    148.413159
dtype: float64

可以把序列(Series)看成定长的有序字典.

In [12]:
data = {"Chengdu":4000, "Shanghai": 6000, "Chongqing": 5000}
obj2 = Series(data)

In [13]:
obj2

Chengdu      4000
Shanghai     6000
Chongqing    5000
dtype: int64

In [14]:
"Qingdao" in obj2

False

In [15]:
"Chengdu" in obj2

True

In [16]:
cities = ["Guangzhou","Shenzhen","Shanghai","Chongqing"]
obj3 = Series(data, index=cities)

In [17]:
obj3

Guangzhou       NaN
Shenzhen        NaN
Shanghai     6000.0
Chongqing    5000.0
dtype: float64

相应的操作:

    pd.isnull()
    pd.notnull()

In [18]:
pd.isnull(obj3)

Guangzhou     True
Shenzhen      True
Shanghai     False
Chongqing    False
dtype: bool

In [19]:
pd.notnull(obj3)

Guangzhou    False
Shenzhen     False
Shanghai      True
Chongqing     True
dtype: bool

### 4.3 Series重要功能: 自动对齐不同索引的数据

In [20]:
obj2 = Series(data)
data3 = {"Chengdu":4000, "Shanghai": 6000, "Xiamen": 4800, "Taipei": 4900}

In [21]:
obj2

Chengdu      4000
Shanghai     6000
Chongqing    5000
dtype: int64

In [22]:
obj3  = Series(data3)

In [23]:
obj3

Chengdu     4000
Shanghai    6000
Xiamen      4800
Taipei      4900
dtype: int64

In [24]:
obj2 + obj3

Chengdu       8000.0
Chongqing        NaN
Shanghai     12000.0
Taipei           NaN
Xiamen           NaN
dtype: float64

#### name属性

In [25]:
obj2.name = "income"
obj2.index.name = "city"

In [26]:
obj2

city
Chengdu      4000
Shanghai     6000
Chongqing    5000
Name: income, dtype: int64

In [27]:
obj2.index = ["CD","SH","CQ"]
obj2

CD    4000
SH    6000
CQ    5000
Name: income, dtype: int64

### 4.3  DataFrame介绍

In [28]:
data3 = {"city": ["Chengdu", "Shanghai", "Xiamen", "Taipei"],"income": [4000,  6000,  4800, 4900]}

In [29]:
data4 = {"city": ["Xian", "Shanghai", "Xiamen", "Taipei"],"income": [4200,  6000,  4800, 4900]}

In [30]:
frame = DataFrame(data3)

In [31]:
frame

       city  income
0   Chengdu    4000
1  Shanghai    6000
2    Xiamen    4800
3    Taipei    4900

In [32]:
frame2 = DataFrame(data4)
frame2

       city  income
0      Xian    4200
1  Shanghai    6000
2    Xiamen    4800
3    Taipei    4900

In [33]:
frame + frame2

               city  income
0       ChengduXian    8200
1  ShanghaiShanghai   12000
2      XiamenXiamen    9600
3      TaipeiTaipei    9800

In [34]:
DataFrame(data3,columns=["income","city"])

   income      city
0    4000   Chengdu
1    6000  Shanghai
2    4800    Xiamen
3    4900    Taipei

In [35]:
DataFrame(data3,columns=["income","city","pop"])

   income      city  pop
0    4000   Chengdu  NaN
1    6000  Shanghai  NaN
2    4800    Xiamen  NaN
3    4900    Taipei  NaN

In [36]:
DataFrame(data3,columns=["income","city","pop"])["income"]

0    4000
1    6000
2    4800
3    4900
Name: income, dtype: int64

In [37]:
frame3 = DataFrame(data3,columns=["income","city","pop"])

In [38]:
frame3

   income      city  pop
0    4000   Chengdu  NaN
1    6000  Shanghai  NaN
2    4800    Xiamen  NaN
3    4900    Taipei  NaN

In [39]:
# **** 从DataFrame中获取一列(Series)
frame3["city"]

0     Chengdu
1    Shanghai
2      Xiamen
3      Taipei
Name: city, dtype: object

In [40]:
frame3.city

0     Chengdu
1    Shanghai
2      Xiamen
3      Taipei
Name: city, dtype: object

In [41]:
frame3.ix[0]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

income       4000
city      Chengdu
pop           NaN
Name: 0, dtype: object

In [42]:
frame3.ix[:]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   income      city  pop
0    4000   Chengdu  NaN
1    6000  Shanghai  NaN
2    4800    Xiamen  NaN
3    4900    Taipei  NaN

In [43]:
frame3.ix[:,0]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    4000
1    6000
2    4800
3    4900
Name: income, dtype: int64

可以为DataFrame的列赋值

In [44]:
frame3 = DataFrame(data3,columns=["income","city","pop"])

In [45]:
frame3

   income      city  pop
0    4000   Chengdu  NaN
1    6000  Shanghai  NaN
2    4800    Xiamen  NaN
3    4900    Taipei  NaN

In [46]:
frame3["pop"] = 2000.

In [47]:
frame3

   income      city     pop
0    4000   Chengdu  2000.0
1    6000  Shanghai  2000.0
2    4800    Xiamen  2000.0
3    4900    Taipei  2000.0

In [48]:
gdp = {"Chengdu":{"2000":30,"2005":45,"2010":70}, "Chongqing":{"2000":25,"2005":35,"2010":60},"Xian":{"2000":28,"2005":48,"2010":75}}

In [49]:
frame4 = DataFrame(gdp)

In [50]:
frame4

      Chengdu  Chongqing  Xian
2000       30         25    28
2005       45         35    48
2010       70         60    75

In [51]:
frame4.Chengdu

2000    30
2005    45
2010    70
Name: Chengdu, dtype: int64

In [52]:
frame4["Chengdu"]

2000    30
2005    45
2010    70
Name: Chengdu, dtype: int64

In [53]:
frame5 =frame4.T
frame5

           2000  2005  2010
Chengdu      30    45    70
Chongqing    25    35    60
Xian         28    48    75

In [54]:
frame4.values

array([[30, 25, 28],
       [45, 35, 48],
       [70, 60, 75]], dtype=int64)

DataFrame的index, columns也有name属性.

In [120]:
frame4.index.name = "Year"; frame4.columns.name = "income"

In [121]:
frame4

income  Chengdu  Chongqing  Xian
Year
2000         30         25    28
2005         45         35    48
2010         70         60    75

In [57]:
frame4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 2000 to 2010
Data columns (total 3 columns):
Chengdu      3 non-null int64
Chongqing    3 non-null int64
Xian         3 non-null int64
dtypes: int64(3)
memory usage: 176.0+ bytes

## 5. Series和DataFrame的基本功能

### 5.1 重新索引

In [58]:
obj

a    1
b    1
c    2
d    3
f    5
dtype: int64

In [59]:
obj.reindex(["f","a","d","b","c"])

f    5
a    1
d    3
b    1
c    2
dtype: int64

In [60]:
obj.reindex(["f","a","d","b","fifth"])

f        5.0
a        1.0
d        3.0
b        1.0
fifth    NaN
dtype: float64

In [61]:
obj5 = Series(["blue","yellow","red"],index=[0,2,4])

In [62]:
obj5

0      blue
2    yellow
4       red
dtype: object

In [63]:
obj5.reindex(range(6),method="ffill") #forward

0      blue
1      blue
2    yellow
3    yellow
4       red
5       red
dtype: object

In [64]:
obj5.reindex(range(6),method="bfill") # backward

0      blue
1    yellow
2    yellow
3       red
4       red
5       NaN
dtype: object

In [65]:
obj.ix[["a","b","d","f","h"]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

a    1.0
b    1.0
d    3.0
f    5.0
h    NaN
dtype: float64

In [66]:
obj.ix[["a","b","d","f"]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

a    1
b    1
d    3
f    5
dtype: int64

### 5.2 丢弃某个轴上的项

In [67]:
obj = Series(np.arange(5), index=["a","b","c","d","e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [68]:
obj.drop(["c","d"])

a    0
b    1
e    4
dtype: int32

In [69]:
obj.drop("c")

a    0
b    1
d    3
e    4
dtype: int32

In [70]:
data = DataFrame(np.arange(16).reshape(4,4), index =["CD","CQ","GZ","XM"], columns=["One","Two","Three","Four"])
data

    One  Two  Three  Four
CD    0    1      2     3
CQ    4    5      6     7
GZ    8    9     10    11
XM   12   13     14    15

In [71]:
data.drop(["GZ","XM"])

    One  Two  Three  Four
CD    0    1      2     3
CQ    4    5      6     7

In [72]:
data.drop("CD",axis=0)

    One  Two  Three  Four
CQ    4    5      6     7
GZ    8    9     10    11
XM   12   13     14    15

In [73]:
data.drop("One",axis=1)

    Two  Three  Four
CD    1      2     3
CQ    5      6     7
GZ    9     10    11
XM   13     14    15

### 5.3 索引与过滤

In [74]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [75]:
obj["e"]

4

In [76]:
obj[1:4]

b    1
c    2
d    3
dtype: int32

In [77]:
obj[1:4][obj>1]

c    2
d    3
dtype: int32

In [78]:
obj[obj>1]

c    2
d    3
e    4
dtype: int32

In [79]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [80]:
obj["b":"e"]

b    1
c    2
d    3
e    4
dtype: int32

In [81]:
# 赋值
obj["b":"d"] = 100

In [82]:
obj

a      0
b    100
c    100
d    100
e      4
dtype: int32

In [83]:
obj[1:4] = 100

In [84]:
obj

a      0
b    100
c    100
d    100
e      4
dtype: int32

In [85]:
# 对DataFrame索引: 获取一列或者多列

In [86]:
data

    One  Two  Three  Four
CD    0    1      2     3
CQ    4    5      6     7
GZ    8    9     10    11
XM   12   13     14    15

In [87]:
data["Four"]

CD     3
CQ     7
GZ    11
XM    15
Name: Four, dtype: int32

In [88]:
data[["Four","One"]]

    Four  One
CD     3    0
CQ     7    4
GZ    11    8
XM    15   12

In [89]:
data[0:3]

    One  Two  Three  Four
CD    0    1      2     3
CQ    4    5      6     7
GZ    8    9     10    11

In [90]:
data[:3]

    One  Two  Three  Four
CD    0    1      2     3
CQ    4    5      6     7
GZ    8    9     10    11

In [91]:
data > 7

      One    Two  Three   Four
CD  False  False  False  False
CQ  False  False  False  False
GZ   True   True   True   True
XM   True   True   True   True

In [92]:
data[data>7]

     One   Two  Three  Four
CD   NaN   NaN    NaN   NaN
CQ   NaN   NaN    NaN   NaN
GZ   8.0   9.0   10.0  11.0
XM  12.0  13.0   14.0  15.0

In [93]:
data[data["Four"]>7]

    One  Two  Three  Four
GZ    8    9     10    11
XM   12   13     14    15

In [94]:
ind = data > 10

In [95]:
data[ind]

     One   Two  Three  Four
CD   NaN   NaN    NaN   NaN
CQ   NaN   NaN    NaN   NaN
GZ   NaN   NaN    NaN  11.0
XM  12.0  13.0   14.0  15.0

## 6. 加载和查看数据

In [98]:
pwd

'C:\\Users\\www\\Desktop\\2018-10-16-Pandas基础\\code'

In [99]:
ls

 驱动器 C 中的卷没有标签。
 卷的序列号是 EE92-3E64

 C:\Users\www\Desktop\2018-10-16-Pandas基础\code 的目录

2018/10/16  14:16    <DIR>          .
2018/10/16  14:16    <DIR>          ..
2018/10/16  08:57    <DIR>          .ipynb_checkpoints
2018/09/10  18:28               100 mydataset.csv
2018/10/16  14:16            76,238 Pandas基础.ipynb
2018/10/16  08:53    <DIR>          proj
2014/03/07  17:47            10,889 wine.csv
               3 个文件         87,227 字节
               4 个目录 81,721,122,816 可用字节

In [100]:
data = pd.read_csv("wine.csv")

In [101]:
data

,Wine,Alcohol,Malic.acid,Ash,Acl,Mg,Phenols,Flavanoids,Nonflavanoid.phenols,Proanth,Color.int,Hue,OD,Proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.640000,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.380000,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.680000,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.800000,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.320000,1.04,2.93,735
5,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.750000,1.05,2.85,1450
6,1,14.39,1.87,2.45,14.6,96,2.50,2.52,0.30,1.98,5.250000,1.02,3.58,1290
7,1,14.06,2.15,2.61,17.6,121,2.60,2.51,0.31,1.25,5.050000,1.06,3.58,1295
8,1,14.83,1.64,2.17,14.0,97,2.80,2.98,0.29,1.98,5.200000,1.08,2.85,1045
9,1,13.86,1.35,2.27,16.0,98,2.98,3.15,0.22,1.85,7.220000,1.01,3.55,1045
10,1,14.10,2.16,2.30,18.0,105,2.95,3.32,0.22,2.38,5.750000,1.25,3.17,1510
11,1,14.12,1.48,2.32,16.8,95,2.20,2.43,0.26,1.57,5.000000,1.17,2.82,1280
12,1,13.75,1.73,2.41,16.0,89,2.60,2.76,0.29,1.81,5.600000,1.15,2.90,1320
13,1,14.75,1.73,2.39,11.4,91,3.10,3.69,0.43,2.81,5.400000,1.25,2.73,1150
14,1,14.38,1.87,2.38,12.0,102,3.30,3.64,0.29,2.96,7.500000,1.20,3.00,1547
15,1,13.63,1.81,2.70,17.2,112,2.85,2.91,0.30,1.46,7.300000,1.28,2.88,1310
16,1,14.30,1.92,2.72,20.0,120,2.80,3.14,0.33,1.97,6.200000,1.07,2.65,1280
17,1,13.83,1.57,2.62,20.0,115,2.95,3.40,0.40,1.72,6.600000,1.13,2.57,1130
18,1,14.19,1.59,2.48,16.5,108,3.30,3.93,0.32,1.86,8.700000,1.23,2.82,1680
19,1,13.64,3.10,2.56,15.2,116,2.70,3.03,0.17,1.66,5.100000,0.96,3.36,845
20,1,14.06,1.63,2.28,16.0,126,3.00,3.17,0.24,2.10,5.650000,1.09,3.71,780
21,1,12.93,3.80,2.65,18.6,102,2.41,2.41,0.25,1.98,4.500000,1.03,3.52,770
22,1,13.71,1.86,2.36,16.6,101,2.61,2.88,0.27,1.69,3.800000,1.11,4.00,1035
23,1,12.85,1.60,2.52,17.8,95,2.48,2.37,0.26,1.46,3.930000,1.09,3.63,1015
24,1,13.50,1.81,2.61,20.0,96,2.53,2.61,0.28,1.66,3.520000,1.12,3.82,845
25,1,13.05,2.05,3.22,25.0,124,2.63,2.68,0.47,1.92,3.580000,1.13,3.20,830
26,1,13.39,1.77,2.62,16.1,93,2.85,2.94,0.34,1.45,4.800000,0.92,3.22,1195
27,1,13.30,1.72,2.14,17.0,94,2.40,2.19,0.27,1.35,3.950000,1.02,2.77,1285
28,1,13.87,1.90,2.80,19.4,107,2.95,2.97,0.37,1.76,4.500000,1.25,3.40,915
29,1,14.02,1.68,2.21,16.0,96,2.65,2.33,0.26,1.98,4.700000,1.04,3.59,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
148,3,13.32,3.24,2.38,21.5,92,1.93,0.76,0.45,1.25,8.420000,0.55,1.62,650
149,3,13.08,3.90,2.36,21.5,113,1.41,1.39,0.34,1.14,9.400000,0.57,1.33,550
150,3,13.50,3.12,2.62,24.0,123,1.40,1.57,0.22,1.25,8.600000,0.59,1.30,500
151,3,12.79,2.67,2.48,22.0,112,1.48,1.36,0.24,1.26,10.800000,0.48,1.47,480
152,3,13.11,1.90,2.75,25.5,116,2.20,1.28,0.26,1.56,7.100000,0.61,1.33,425
153,3,13.23,3.30,2.28,18.5,98,1.80,0.83,0.61,1.87,10.520000,0.56,1.51,675
154,3,12.58,1.29,2.10,20.0,103,1.48,0.58,0.53,1.40,7.600000,0.58,1.55,640
155,3,13.17,5.19,2.32,22.0,93,1.74,0.63,0.61,1.55,7.900000,0.60,1.48,725
156,3,13.84,4.12,2.38,19.5,89,1.80,0.83,0.48,1.56,9.010000,0.57,1.64,480
157,3,12.45,3.03,2.64,27.0,97,1.90,0.58,0.63,1.14,7.500000,0.67,1.73,880
158,3,14.34,1.68,2.70,25.0,98,2.80,1.31,0.53,2.70,13.000000,0.57,1.96,660
159,3,13.48,1.67,2.64,22.5,89,2.60,1.10,0.52,2.29,11.750000,0.57,1.78,620
160,3,12.36,3.83,2.38,21.0,88,2.30,0.92,0.50,1.04,7.650000,0.56,1.58,520
161,3,13.69,3.26,2.54,20.0,107,1.83,0.56,0.50,0.80,5.880000,0.96,1.82,680
162,3,12.85,3.27,2.58,22.0,106,1.65,0.60,0.60,0.96,5.580000,0.87,2.11,570
163,3,12.96,3.45,2.35,18.5,106,1.39,0.70,0.40,0.94,5.280000,0.68,1.75,675
164,3,13.78,2.76,2.30,22.0,90,1.35,0.68,0.41,1.03,9.580000,0.70,1.68,615
165,3,13.73,4.36,2.26,22.5,88,1.28,0.47,0.52,1.15,6.620000,0.78,1.75,520
166,3,13.45,3.70,2.60,23.0,111,1.70,0.92,0.43,1.46,10.680000,0.85,1.56,695
167,3,12.82,3.37,2.30,19.5,88,1.48,0.66,0.40,0.97,10.260000,0.72,1.75,685
168,3,13.58,2.58,2.69,24.5,105,1.55,0.84,0.39,1.54,8.660000,0.74,1.80,750
169,3,13.40,4.60,2.86,25.0,112,1.98,0.96,0.27,1.11,8.500000,0.67,1.92,630
170,3,12.20,3.03,2.32,19.0,96,1.25,0.49,0.40,0.73,5.500000,0.66,1.83,510
171,3,12.77,2.39,2.28,19.5,86,1.39,0.51,0.48,0.64,9.899999,0.57,1.63,470
172,3,14.16,2.51,2.48,20.0,91,1.68,0.70,0.44,1.24,9.700000,0.62,1.71,660
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.700000,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.300000,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.200000,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.300000,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.200000,0.61,1.60,560

In [102]:
data.head()

,Wine,Alcohol,Malic.acid,Ash,Acl,Mg,Phenols,Flavanoids,Nonflavanoid.phenols,Proanth,Color.int,Hue,OD,Proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [104]:
data.tail(10)

,Wine,Alcohol,Malic.acid,Ash,Acl,Mg,Phenols,Flavanoids,Nonflavanoid.phenols,Proanth,Color.int,Hue,OD,Proline
168,3,13.58,2.58,2.69,24.5,105,1.55,0.84,0.39,1.54,8.660000,0.74,1.80,750
169,3,13.40,4.60,2.86,25.0,112,1.98,0.96,0.27,1.11,8.500000,0.67,1.92,630
170,3,12.20,3.03,2.32,19.0,96,1.25,0.49,0.40,0.73,5.500000,0.66,1.83,510
171,3,12.77,2.39,2.28,19.5,86,1.39,0.51,0.48,0.64,9.899999,0.57,1.63,470
172,3,14.16,2.51,2.48,20.0,91,1.68,0.70,0.44,1.24,9.700000,0.62,1.71,660
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.700000,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.300000,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.200000,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.300000,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.200000,0.61,1.60,560

In [105]:
df = pd.read_csv("mydataset.csv")

In [106]:
df.head()

  Name    Hight  Weight  score
0   Gang     91      95     93
1  Shuan     88      88     88
2   Yang     69      80     70
3     Li     78      79     79
4    Shi     55      88     78

In [107]:
df.describe()

           Hight     Weight      score
count   5.000000   5.000000   5.000000
mean   76.200000  86.000000  81.600000
std    14.686729   6.595453   9.016651
min    55.000000  79.000000  70.000000
25%    69.000000  80.000000  78.000000
50%    78.000000  88.000000  79.000000
75%    88.000000  88.000000  88.000000
max    91.000000  95.000000  93.000000

In [108]:
df.sum()

Name      GangShuanYangLiShi
Hight                    381
Weight                   430
score                    408
dtype: object

In [109]:
df.mean()

Hight     76.2
Weight    86.0
score     81.6
dtype: float64

In [110]:
df.var()

Hight     215.7
Weight     43.5
score      81.3
dtype: float64

In [112]:
df.iloc[:,1:]

   Hight  Weight  score
0     91      95     93
1     88      88     88
2     69      80     70
3     78      79     79
4     55      88     78

In [113]:
df.iloc[:,1:].cumsum()

   Hight  Weight  score
0     91      95     93
1    179     183    181
2    248     263    251
3    326     342    330
4    381     430    408

In [114]:
df.iloc[:,1:].diff()

   Hight  Weight  score
0    NaN     NaN    NaN
1   -3.0    -7.0   -5.0
2  -19.0    -8.0  -18.0
3    9.0    -1.0    9.0
4  -23.0     9.0   -1.0

In [115]:
df.columns

Index(['Name  ', 'Hight', 'Weight', 'score'], dtype='object')

In [116]:
data.columns

Index(['Wine', 'Alcohol', 'Malic.acid', 'Ash', 'Acl', 'Mg', 'Phenols',
       'Flavanoids', 'Nonflavanoid.phenols', 'Proanth', 'Color.int', 'Hue',
       'OD', 'Proline'],
      dtype='object')